import gstyles from "../../src/styles/ImageGrid.module.css"; // Import your custom styles

const imageData = [
  {
    src: "/samples/SkinCure/s1.png",
    title: "اگزما",
    description:
      "اگزما یک بیماری پوستی مزمن است که با خشکی، خارش و التهاب پوست همراه است. درمان آن معمولاً شامل استفاده از کرم‌های مرطوب‌کننده، پمادهای استروئیدی برای کاهش التهاب و در موارد شدیدتر، داروهای سرکوب‌کننده سیستم ایمنی است. همچنین، پرهیز از مواد تحریک‌کننده و آلرژی‌زا نقش مهمی در کنترل علائم دارد.",
  },
  {
    src: "/samples/SkinCure/s2.png",
    title: "اگزوما",
    description:
      "اگزما یک بیماری پوستی مزمن است که با خشکی، خارش و التهاب پوست همراه است. درمان آن معمولاً شامل استفاده از کرم‌های مرطوب‌کننده، پمادهای استروئیدی برای کاهش التهاب و در موارد شدیدتر، داروهای سرکوب‌کننده سیستم ایمنی است. همچنین، پرهیز از مواد تحریک‌کننده و آلرژی‌زا نقش مهمی در کنترل علائم دارد.",
  },
  {
    src: "/samples/SkinCure/s3.png",
    title: "کریون سر",
    description:
      "کریون سر (Crusted Scabies) یک نوع شدید از گال است که با پوسته‌های ضخیم و خارش شدید همراه است. درمان آن شامل استفاده از کرم‌های ضد انگل مانند پرمترین یا لوسیون لیندان است. همچنین در موارد پیشرفته، ممکن است داروی خوراکی ایورمکتین تجویز شود. رعایت بهداشت و ضدعفونی کردن لباس‌ها و وسایل شخصی هم برای پیشگیری از گسترش بیماری ضروری است.",
  },
  {
    src: "/samples/SkinCure/s4.png",
    title: "ارتیکاریا",
    description:
      "این حالت معمولاً به صورت خارش و بروز برآمدگی‌های قرمز و متورم بر روی پوست ظاهر می‌شود و ممکن است به دلیل واکنش آلرژیک به بزاق پشه یا سایر عوامل تحریک‌کننده ایجاد شود. درمان آن شامل استفاده از آنتی‌هیستامین‌ها برای کاهش خارش و التهاب و در موارد شدیدتر، داروهای کورتیکواستروئیدی است.",
  },
  {
    src: "/samples/SkinCure/s5.png",
    title: "بولوس پمفیگوئید",
    description:
      "بولوس پمفیگوئید یک بیماری خودایمنی پوستی است که باعث تشکیل تاول‌های بزرگ و خارش‌دار می‌شود. درمان آن شامل استفاده از کورتیکواستروئیدها و داروهای سرکوب‌کننده سیستم ایمنی برای کنترل التهاب و علائم است.",
  },
  {
    src: "/samples/SkinCure/s6.png",
    title: "بولوس پمفیگوئید",
    description:
      "بولوس پمفیگوئید یک بیماری خودایمنی پوستی است که باعث تشکیل تاول‌های بزرگ و خارش‌دار می‌شود. درمان آن شامل استفاده از کورتیکواستروئیدها و داروهای سرکوب‌کننده سیستم ایمنی برای کنترل التهاب و علائم است.",
  },
  {
    src: "/samples/SkinCure/s7.png",
    title: "بولوس پمفیگوئید",
    description:
      "بولوس پمفیگوئید یک بیماری خودایمنی پوستی است که باعث تشکیل تاول‌های بزرگ و خارش‌دار می‌شود. درمان آن شامل استفاده از کورتیکواستروئیدها و داروهای سرکوب‌کننده سیستم ایمنی برای کنترل التهاب و علائم است.",
  },
  {
    src: "/samples/SkinCure/s8.png",
    title: "بولوس پمفیگوئید",
    description:
      "بولوس پمفیگوئید یک بیماری خودایمنی پوستی است که باعث تشکیل تاول‌های بزرگ و خارش‌دار می‌شود. درمان آن شامل استفاده از کورتیکواستروئیدها و داروهای سرکوب‌کننده سیستم ایمنی برای کنترل التهاب و علائم است.",
  },
  {
    src: "/samples/SkinCure/s9.png",
    title: "گرانولوم پیوژنیک",
    description:
      "گرانولوم پیوژنیک یک تومور خوش‌خیم است که معمولاً در محل زخم‌ها یا آسیب‌های پوستی، مانند ناحیه پیرسینگ، ایجاد می‌شود و به صورت برآمدگی قرمز و خونی ظاهر می‌شود. درمان آن شامل جراحی برای برداشت، لیزر درمانی، یا تزریق داروهای استروئیدی به ناحیه آسیب‌دیده است.",
  },
  {
    src: "/samples/SkinCure/s10.png",
    title: "کلوئید",
    description:
      "کلوئید نوعی زخم یا ضایعه پوستی است که به دلیل رشد بیش از حد بافت اسکار پس از آسیب یا جراحی ایجاد می‌شود و به صورت برآمدگی‌های سخت و برجسته ظاهر می‌شود. درمان آن معمولاً شامل روش‌هایی مانند کرم‌های استروئیدی، لیزر درمانی، و در موارد شدیدتر، جراحی برای برداشتن کلوئید است.",
  },
  {
    src: "/samples/SkinCure/s11.png",
    title: "اسکار هایپرتروفیک",
    description:
      "اسکار هایپرتروفیک نوعی زخم است که پس از آسیب یا جراحی ایجاد می‌شود و به صورت برجسته و قرمز در ناحیه زخم ظاهر می‌شود، اما معمولاً از حاشیه زخم فراتر نمی‌رود. درمان آن شامل استفاده از کرم‌های استروئیدی، نوارهای فشاری، و در برخی موارد، لیزر درمانی برای کاهش ظاهر و بهبود بافت زخم است.",
  },
  {
    src: "/samples/SkinCure/s12.png",
    title: "پسوریازیس واکنشی",
    description:
      " این وضعیت معمولاً به دلیل تحریک سیستم ایمنی ناشی از داروها یا تزریقات است و می‌تواند منجر به تشدید علائم پسوریازیس یا بروز ضایعات جدید در ناحیه تزریق شود. درمان این وضعیت معمولاً شامل قطع دارو و مدیریت علائم با استفاده از درمان‌های موضعی یا سیستمیک پسوریازیس است.",
  },
];

const ImageBox = ({ src, title, description }) => (
  <div
    className={`${gstyles.box} sm:p-6 lg:p-0 relative bg-transparent transition-all duration-75 overflow-hidden mr-4 mt-12`}
  >
    <div className={gstyles.imgBx}>
      <img src={src} alt={title} />
    </div>
    <div
      className={`${gstyles.content} lg:w-full w-56 p-2 dark:bg-slate-900 opacity-85`}
    >
      <div>
        <h2 className="font-title text-purple-500 dark:text-purple-200 dark:shadow-blue-200 dark:bg-slate-500 bg-purple-50 rounded-md w-fit p-1 shadow-xl shadow-blue-700">
          {title}
        </h2>
        <p className="font-regular bg-slate-700 mt-2 text-white shadow-xl dark:text-blue-200 dark:shadow-blue-950 shadow-blue-600">
          {description}
        </p>
      </div>
    </div>
  </div>
);

const ImageGrid = () => {
  const columns = [
    imageData.slice(0, 3),
    imageData.slice(3, 6),
    imageData.slice(6, 9),
    imageData.slice(9, 12),
  ];

  return (
    <div
      className={`${gstyles.ImageGridContainer} grid mt-20 gap-10 sm:grid-cols-2 md:grid-cols-3 xl:grid-cols-4 ml-10`}
    >
      {columns.map((column, columnIndex) => (
        <div className={gstyles.gridColumn} key={columnIndex}>
          {column.map((image, index) => (
            <ImageBox
              key={index}
              src={image.src}
              title={image.title}
              description={image.description}
            />
          ))}
        </div>
      ))}
    </div>
  );
};

export default ImageGrid;
